use super::PetArt;

pub const CHILD: &[PetArt] = &[
    // 子鳥
    PetArt {
        creature_type: "子鳥",
        color: "\x1b[93m",
        art: "\
\n     ████████\
\n  ▄▄▀▄▄▄▄▄▄▄▄▀▄▄\
\n  ██▀▀▀▀▀▀▀▀▀▀██\
\n▄▄█            █▄▄\
\n██  ▀    ▀▀     ██\
\n██     █▀       ██\
\n██              ██\
\n▀▀▄▄          ▄▄▀▀\
\n    █▄▄▄▄▄▄▄▄█\
\n     ██    ██\
\n    ▄██  ▄▄██\n",
    },
    // 子うさぎ
    PetArt {
        creature_type: "子うさぎ",
        color: "\x1b[97m",
        art: "\
\n        ██   ▄▄\
\n      ▄█▀▀ ▄▀\
\n    ▄▀▀▀▀▀█  ▄█\
\n  ▄▀        ▀█▄\
\n ▄█ ▄▄   ▄    ▀▄\
\n▄██            █▄\
\n███            ███\
\n ▀▀            ██▀\
\n   █▄         ▄▀\
\n    ▀█▄    ▄▄█▀\
\n      ██▀▀▀██\
\n    ███    ██\n",
    },
    // 子猫
    PetArt {
        creature_type: "子猫",
        color: "\x1b[93m",
        art: "\
\n    █        █\
\n  ██ ██    ██ ██\
\n  ██ ▀██████▀ ██\
\n▄▄▀▀          ▀▀▄▄\
\n██  ▄      ▄    ██\
\n██  ▀  ▄▄  ▀▀   ██\
\n▀▀▄▄   ▀▀     ▄▄▀▀\
\n  ██▄        ▄██\
\n  ▀▀██████████▀▀\
\n     ██     ▀█\
\n    ███    ███\n",
    },
    // 子狐
    PetArt {
        creature_type: "子狐",
        color: "\x1b[91m",
        art: "\
\n    ▄▄▀▀▀▀▀▀▄▄\
\n  ▄▀          ▀▄\
\n █              █\
\n█        ▀    ▄  █\
\n█             █  █\
\n▀▄ ▄          ▀ ▄▀\
\n  ▀█         █\
\n     ▀▄▄▄▄▄▄▀▀\
\n     ▄█    █▄\n",
    },
    // 子犬
    PetArt {
        creature_type: "子犬",
        color: "\x1b[93m",
        art: "\
\n    ███████\
\n ▄█▀       ██\
\n██▀ ▄   ▄  ▀██\
\n██  ▀▄▄ ▀    █\
\n▀▀▄▄ ▀▀    ▄▄▀▄▄ ▄\
\n  ▀▀▄▄▄▄▄▄▄▀  ▀█▄▀\
\n    █▀▀▀▀▀     █▀\
\n    ██▄     ▄██\
\n     ██████████\
\n     ▀▀ █  ▀▀▀▀\n",
    },
    // 子スライム
    PetArt {
        creature_type: "子スライム",
        color: "\x1b[92m",
        art: "\
\n    ▄█▀▀▀▀▀▀█▄\
\n  ▄▀          ▀▄\
\n █              █\
\n█   ▄▄     ▄▄    █\
\n█   ▀▀     ▀▀    █\
\n█      ▀▀▀       █\
\n ▀▄            ▄▀\
\n   ▀█ ▄▄▄▄▄▄ █▀\
\n    █▄█    █▄█\n",
    },
];
