use super::PetArt;

pub const EGG: &[PetArt] = &[
    // にっこり
    PetArt {
        creature_type: "???",
        art: "\
\n   ▄▀▀▀▀▀▀▀▀▄\
\n ▄▀          ▀▄\
\n █   ▄    ▄   █\
\n █            █\
\n █    ▀▄▄▀    █\
\n  ▀▄        ▄▀\
\n    ▀▀▄▄▄▄▀▀\n",
    },
    // ねむい
    PetArt {
        creature_type: "???",
        art: "\
\n   ▄▄▀▀▀▀▄▄\
\n  ▄        ▄\
\n ▄          ▄\
\n▄            ▄\
\n█   ▀▀   ▀▀  █\
\n█     ▀▀     █\
\n▀▄          ▄▀\
\n ▀▄        ▄▀\
\n   ▀▄▄▄▄▄▄▀\n",
    },
    // びっくり
    PetArt {
        creature_type: "???",
        art: "\
\n    ▄█▀▀█▄\
\n  ▄▀      ▀▄\
\n ▄▀        ▀▄\
\n▄▀  ▄    ▄  ▀▄\
\n█     ▄▄     █\
\n█    █  █    █\
\n ▀▄   ▀▀   ▄▀\
\n   ▀▄▄▄▄▄▄▀\n",
    },
    // おこ
    PetArt {
        creature_type: "???",
        art: "\
\n      ▄▄\
\n    ▄▀  ▀▄\
\n   █      █\
\n   █ ▀  ▀ █\
\n   █      █\
\n    ▀▄▄▄▄▀\n",
    },
    // ウインク
    PetArt {
        creature_type: "???",
        art: "\
\n   ▄█▀▀▀██▄\
\n  ▄▀      ██▄\
\n ▄▀        ▀█\
\n▄█  ▄   ▄▄▄  █\
\n█   ▀▀  ▀  ▀ █\
\n█      ▄     █\
\n▀▄           █\
\n ▀▄         ▄\
\n   ▀▄▄▄▄▄▄ ▀\n",
    },
    // わらい
    PetArt {
        creature_type: "???",
        art: "\
\n     ▀▀▀█▄\
\n  ▄▀      ▀▄\
\n ▄          ▄\
\n█   ▀    ▀  ▀█\
\n█    ▄▄▄█  ▀ █\
\n█     ▀▄▀    █\
\n█            █\
\n █          █\
\n  ▀ ▄▄▄▄▄▄ ▀\n",
    },
    // きょとん
    PetArt {
        creature_type: "???",
        art: "\
\n   ▄▀▀▀▀▀▀▀▀▄\
\n ▄▀          ▀▄\
\n █   ▄    ▄   █\
\n █            █\
\n █     ▀▀     █\
\n  ▀▄        ▄▀\
\n    ▀▀▄▄▄▄▀▀\n",
    },
    // むすっ
    PetArt {
        creature_type: "???",
        art: "\
\n   ▄▀▀▀▀▀▀▀▀▄\
\n ▄▀          ▀▄\
\n █   ▄    ▄   █\
\n █            █\
\n █    ▀▀▀▀    █\
\n  ▀▄        ▄▀\
\n    ▀▀▄▄▄▄▀▀\n",
    },
    // うるうる
    PetArt {
        creature_type: "???",
        art: "\
\n   ▄▀▀▀▀▀▀▀▀▄\
\n ▄▀          ▀▄\
\n █  ▄▀   ▀▄   █\
\n █  ▀▄   ▄▀   █\
\n █     ▄▄     █\
\n  ▀▄        ▄▀\
\n    ▀▀▄▄▄▄▀▀\n",
    },
    // すやすや
    PetArt {
        creature_type: "???",
        art: "\
\n   ▄▀▀▀▀▀▀▀▀▄\
\n ▄▀          ▀▄\
\n █   ▀▀  ▀▀   █\
\n █            █\
\n █     ▄▄     █\
\n  ▀▄      z ▄▀\
\n    ▀▀▄▄▄▄▀▀\n",
    },
    // ぷんぷん
    PetArt {
        creature_type: "???",
        art: "\
\n   ▄▀▀▀▀▀▀▀▀▄\
\n ▄▀ ▀▄    ▄▀ ▀▄\
\n █   ▄    ▄   █\
\n █            █\
\n █   ▀▀▀▀▀   █\
\n  ▀▄        ▄▀\
\n    ▀▀▄▄▄▄▀▀\n",
    },
];
