use super::PetArt;

pub const TEEN: &[PetArt] = &[
    // 子ドラゴン
    PetArt {
        creature_type: "子ドラゴン",
        color: "\x1b[91m",
        art: "\
\n          ▀▄ ▄█▄▄\
\n           █▀    ▀▄\
\n          █   ▄  ▄█\
\n      ▄▄▄▄█▄     ▄ █\
\n       ▀██▄█ ▄▄▄▄▄▀\
\n  ██▄    ▀█▀ █▄█\
\n▄▄   ▀  █▀  ▄██▀█▄\
\n█▄█    ▄▀ ▄▄▄ █ █▄█\
\n █ ▀▄▄▀     ▀▀  █\
\n  ▀▄▄▄ ▀   █▀▀█▀█\
\n     ▀▀▀█ ▄█▀█ █\
\n        █▄▄█ ▄▄▄█\n",
    },
    // 九尾狐
    PetArt {
        creature_type: "九尾狐",
        color: "\x1b[91m",
        art: "\
\n        ▄   █▄    ▄█\
\n   ▀▀  ▄  ▀ █ █  █▀█\
\n ▄ ▄▄   ▄   ▀    ▀ ▀\
\n █   ▀    ▄ █      █\
\n█ █▄▄▄ ▄▄▄   ▀▄  ▄▀\
\n   ▄  ▀█▀   ▀\
\n█▀▀   █         ▄▀\
\n   ▀  █▄ ██▀▀▄ ██\
\n      █  ██  ▀█ █\
\n      ▀   ▀   █ ▀\n",
    },
];
