use super::{PetArt, PetColor};

pub const TEEN: &[PetArt] = &[
    // 子ドラゴン
    PetArt {
        creature_type: "子ドラゴン",
        color: PetColor::Red,
        art: "\
\n          ▀▄ ▄█▄▄\
\n           █▀    ▀▄\
\n          █   ▄  ▄█\
\n      ▄▄▄▄█▄     ▄ █\
\n       ▀██▄█ ▄▄▄▄▄▀\
\n  ██▄    ▀█▀ █▄█\
\n▄▄   ▀  █▀  ▄██▀█▄\
\n█▄█    ▄▀ ▄▄▄ █ █▄█\
\n █ ▀▄▄▀     ▀▀  █\
\n  ▀▄▄▄ ▀   █▀▀█▀█\
\n     ▀▀▀█ ▄█▀█ █\
\n        █▄▄█ ▄▄▄█\n",
    },
    // 九尾狐
    PetArt {
        creature_type: "九尾狐",
        color: PetColor::Red,
        art: "\
\n        ▄   █▄    ▄█\
\n   ▀▀  ▄  ▀ █ █  █▀█\
\n ▄ ▄▄   ▄   ▀    ▀ ▀\
\n █   ▀    ▄ █      █\
\n█ █▄▄▄ ▄▄▄   ▀▄  ▄▀\
\n   ▄  ▀█▀   ▀\
\n█▀▀   █         ▄▀\
\n   ▀  █▄ ██▀▀▄ ██\
\n      █  ██  ▀█ █\
\n      ▀   ▀   █ ▀\n",
    },
    // おばけ
    PetArt {
        creature_type: "おばけ",
        color: PetColor::White,
        art: "\
\n     ▄▄██▀▀▀█▄▄\
\n   ▄█▀        ▀█▄\
\n  ▄█            █▄\
\n  █▀   ▄█▄  █▄  ▀█\
\n  █▄    ▀   ▀▀  ▄█\
\n   █▄          ▄█\
\n   ▄█▀        ▀█\
\n  █▀            ▀▄\
\n  ▀▀█          █▀▀\
\n   ▄█         ██\
\n ▄█▀ ▄▄   ▄▄ ▄▀█\
\n▀█▄█▀ ██▄ █▀▄█▀\
\n      ▄█▀  ▀▀\n",
    },
    // コウモリ
    PetArt {
        creature_type: "コウモリ",
        color: PetColor::Magenta,
        art: "\
\n ▄▄█▄  ▄  █  ▄█▄▄\
\n▀▀████ ████ ████▀▀\
\n  ▀▀██████████▀▀\
\n      ▀████▀\
\n        █▀\n",
    },
    // ヘビ
    PetArt {
        creature_type: "ヘビ",
        color: PetColor::Green,
        art: "\
\n        ▄▄███▄\
\n       ▄██▄▄███▄\
\n       ███ ███▀\
\n       ▀██ ▀\
\n         ██\
\n   ▄▄██▄▄ ██\
\n   █████████   ▄▄\
\n▄█▄████████▀ ▄▀██▄\
\n████████████▄▄████\
\n ▀▀████████████▀▀\n",
    },
    // トカゲ
    PetArt {
        creature_type: "トカゲ",
        color: PetColor::Green,
        art: "\
\n ▄███▄\
\n███▄███\
\n ▀▀████\
\n   █████\
\n ▄███████\
\n ▀ ███████\
\n   ▄███████▄\
\n   ██ ▀██▀███▄\
\n  ▄▄█ ▄▄█  ▀▀▀██▄▄\n",
    },
    // サメ
    PetArt {
        creature_type: "サメ",
        color: PetColor::Blue,
        art: "\
\n        ▄█       ▄\
\n  ▄▄▄▄▄███▄▄▄  ▄█▀\
\n▀███▀████████████\
\n  ▄▄▄ ▀█████▀▀ ▀█▄\
\n   ▀   ▀▀█\n",
    },
    // 骸骨
    PetArt {
        creature_type: "骸骨",
        color: PetColor::White,
        art: "\
\n   ▄▀▀▀▀▀▀▄\
\n  █        █\
\n  █ ██  ██ █\
\n   █      █\
\n    ▀▄▄▄▄▀\
\n      ██\
\n   █▀████▀█\
\n  █ ▄ ██ ▄ █\
\n █  ▀▀██▀▀  █\
\n█    ▀▀▀▀    █\
\n█  ▄█ ▄▄ █▄  █\
\n█▀  ▄█▀▀█▄  ▀█\
\n ▀  █    █  ▀\
\n    ▀    ▀\
\n    █    █\
\n    █    █\
\n  ▄██    ██▄\n",
    },
    // キングスライム
    PetArt {
        creature_type: "キングスライム",
        color: PetColor::Green,
        art: "\
\n     █▄ ▄▄ ▄█\
\n     ▀ ▀  ▀ ▀\
\n     ▄██████▄\
\n  ▄████████████▄\
\n █████ ████ █████\
\n▄████████████████▄\
\n██████████████████\
\n██████████████████\
\n ▀▀████████████▀▀\n",
    },
    // チョウ
    PetArt {
        creature_type: "チョウ",
        color: PetColor::Magenta,
        art: "\
\n█▀█▀▄        ▄▀█▀█\
\n▀▄ ▄▀▀      ▀▀▄ ▄▀\
\n █▀█▀▀ ████ ▀▀█▀█\
\n  ▀█▀▀▀▀██▀▀▀▀█▀\
\n  █▄▀█ ▄▀▀▄ █▀▄█\
\n   ▀█▄█    █▄█▀\n",
    },
];
